"""
# 元组（Tuple）的基本定义
元组（Tuple）是Python中的一种内置数据类型，用于存储多个有序的元素。与列表（List）类似，元组也是一种序列类型，但它具有不可变性，这意味着一旦创建，元组中的元素就不能被修改、添加或删除。
## 创建元组
元组可以通过圆括号`()`来创建，元素之间用逗号`,`分隔。例如：
```python
my_tuple = (1, 2, 3, 'a', 'b', 'c')
```
"""

# 元组字面量
(1, 2, 3, "a", "b", "c")


# 元组变量
t1 = (1, 2, 3, "a", "b", "c")
print(t1, type(t1))  # 输出: (1, 2, 3, 'a', 'b', 'c') <class 'tuple'>

# 空元组
t2 = ()  # 方式一
t3 = tuple()  # 方式二
print(t2, type(t2), t3, type(t3))  # 输出: () <class 'tuple'>   () <class 'tuple'>

# 单元素元组
t4 = (1,)  # 注意逗号
t5 = (1,)  # 省略括号
print(t4, type(t4), t5, type(t5))  # 输出: (1,) <class 'tuple'>   (1,) <class 'tuple'>


# 元组的嵌套
t6 = (1, 2, (3, 4, 5))
print(t6[2][0])  # 输出: 3
