d = {
    "王力宏": {
        "部门": "科技部",
        "工资": 3000,
        "级别": 1,
    },
    "周杰伦": {
        "部门": "市场部",
        "工资": 5000,
        "级别": 2,
    },
    "林俊杰": {
        "部门": "销售部",
        "工资": 7000,
        "级别": 3,
    },
    "陈奕迅": {
        "部门": "销售部",
        "工资": 7000,
        "级别": 3,
    },
    "张学友": {
        "部门": "科技部",
        "工资": 3000,
        "级别": 1,
    },
}
print(d)
for key in d.keys():
    if d[key]["级别"] == 1:
        d[key]["级别"] += 1
        d[key]["工资"] += 1000

print(d)
