"""
案例：深浅拷贝
记忆：
    1.深浅拷贝指的是copy模块的copy()和deepcopy()方法
    2.深拷贝：将任何修改都互不影响
    3.浅拷贝：第一层修改互不影响，嵌套子列表修改会同步
    4.深浅拷贝主要是针对于可变类型来讲的，深拷贝拷贝所有层（可变），
    浅拷贝只拷贝第一层（可变），
    如果是针对于不可变类型，则用法和普通赋值一样，并无区别
"""
import copy
def dm01_普通赋值():
    # 1.python中的赋值操作，属于引用赋值（把a的地址赋值给b）
    # 不可变类型
    a = 10
    b = a
    print('id(a)--->', id(a))       # 0x01
    print('id(b)--->', id(b))       # 0x01
    print('id(10)--->', id(10))    # 0x01
    # 可变类型
    a = [1, 2, 3]
    b = [11, 22, 33]
    c = [a, b]
    d = c
    print('id(c)--->', id(c))       # 0x02
    print('id(d)--->', id(d))       # 0x02

def dm02_浅拷贝可变类型():
    a = [1, 2, 3]
    b = [11, 22, 33]
    c = [6, 7, a, b]

    # d = copy.deepcopy(c)     # 深拷贝
    d = copy.copy(c)         # 浅拷贝
    # d = c                    # 普通拷贝

    print('id(c)--->', id(c))       # 0x02
    print('id(d)--->', id(d))       # 0x03
    print("id(c)和id(d)值不一样，说明浅拷贝只拷贝第一层")

    # 测试2
    print(id(c[2]))
    print(id(a))

    # 修改a[2] = 22
    a[2] = 22
    c[1] = 66
    # c[0] = 100
    print('c->', c) # [6, 66, [1, 2, 22], [11, 22, 33]]
    print('d->', d) # [6, 7, [1, 2, 22], [11, 22, 33]]


def dm03_浅拷贝不可变类型():
    # 不可变类型
    # 深/浅拷贝不可变类型，和普通赋值一样，并无区别
    a = (1, 2, 3)       # 0x01
    b = (11, 22, 33)    # 0x02
    c = (6, 7, a, b)    # 0x03

    d = copy.copy(c)
    print('id(c)--->', id(c))       # 0x03
    print('id(d)--->', id(d))       # 0x03

def dm04_深拷贝可变类型():
    # 可变类型
    a = [1, 2, 3]       # 0x01
    b = [11, 22, 33]    # 0x02
    c = [6, 7, a, b]     # 0x03

    d = copy.deepcopy(c)     # 深拷贝
    # d = copy.copy(c)         # 浅拷贝
    # d = c                    # 普通拷贝

    print('id(c)--->', id(c))       # 0x03
    print('id(d)--->', id(d))       # 0x04

    a[1] = 100
    b[1] = 800
    print(f"c-> {c}")
    print(f"d-> {d}")

def dm05_深拷贝拷贝不可变类型():
    # 不可变类型
    a = (1, 2, 3)       # 0x01
    b = (11, 22, 33)    # 0x02
    c = (6, 7, a, b)    # 0x03

    d = copy.deepcopy(c)
    print('id(c)--->', id(c))       # 0x03
    print('id(d)--->', id(d))       # 0x03

# 测试
if __name__ == '__main__':
#    dm01_普通赋值()
#    dm02_浅拷贝可变类型()
#    dm03_浅拷贝不可变类型()
#    dm04_深拷贝可变类型()

    dm05_深拷贝拷贝不可变类型()
