"""
    m.n精度控制
    - m控制宽度，n控制小数点后位数
"""

age = 11
height = 172.567
name = "周杰伦"

print("年龄%5d岁" % age)  # 5个字符宽度，右对齐

print("年龄%1d岁" % age)  # 字符宽度小于数字位数，精度控制不生效

print("年龄%3.2d岁" % age)  # 整数对小数精度控制不理会

print("身高%3.2d米" % height)  # 用整数接收小数，则小数部分丢失.n控制不生效，m控制生效。

print("-" * 20)

# 总宽度7位，小数点精度2位，小数点部分会四舍五入
print("身高%7.2fcm" % height)  # .2f控制小数点后两位

# 对于浮点数，m如果设置小于真实宽度，同样不生效
print("身高%5.2fcm" % height)  # .2f控制小数点后两位

# 可以不控制宽度只控制小数精度
print("身高%.2fcm" % height)

# 可以通过宽度控制对齐输出
print("年龄：%6d岁" % age)
print("身高：%6.2fcm" % height)

print("-" * 20)

# 显示对齐，格式化宽度控制
print("您的余额：%5d元" % 100)
print("您的余额：%5d元" % 1000)
print("您的余额：%5d元" % 10000)
